/**
 * Math.FunctionName 
 * গণিতের অনেক গুলা কাজ জাভাস্ক্রিপ্ট ইজিলি করতে দেয়। আগেত্তেই জাভাস্ক্রিপ্টের মিস্তিরিরা কিছু ফাংশন বানাইয়া রাখছে। সেইগুলা Math নামক একটা অবজেক্ট এর মধ্যে রেখে দিছে। আমরা ম্যাথ এর পর ডট দিয়ে সেগুলা ব্যাবহার করতে পারি।
 */


console.log(Math.round(5.341))  // Output = 5
        //--->> .round দশমিক মান কে রাউন্ড ফিগারে রুপান্তর করে। তবে দশমিকের নিকটবর্তী পুর্নসংখ্যা দেয়।

        
console.log(Math.floor(5.341))  // Output = 5
        //--->> .floor (মেঝে) দশমিক মান কে রাউন্ড ফিগারে রুপান্তর করে। তবে দশমিকের পূর্বের পুর্নসংখ্যা দেয়।

console.log(Math.ceil(5.341))  // Output = 6
        //--->> .(Celing) সিলিং দশমিক মান কে রাউন্ড ফিগারে রুপান্তর করে। তবে দশমিক সংখ্যার পরবর্তী পুর্নসংখ্যা দেয়।

console.log(Math.abs(- 5.341))  // Output = 5.341
        //--->> .abs সংখ্যাকে + বা - যাই থাকুক তাকে + এর করে দেয়।

console.log(Math.random())  // Output = Anything
        //--->> .random যেকোনো মান কে দিতে পারে।

const rand = Math.round(Math.random()*10)
console.log(rand)  // Output = Anything
        //--->> .random যেকোনো মান কে দিতে পারে। ১০ দ্বারা গুন করে একটি পুর্ণ সংখ্যা পাচ্ছি। এটা লটারির কাজে ব্যাবহার করা যায়।



