/*
কোনো একট আভেরিয়েবল এর মান ট্রু না কি ফলস তা বেশ কিছু টাইপের উপর নির্ভর করে

>> Truthy Value
১। বুলিয়ান ভেরিয়েবল এর মান যদি true হয়।
২। শুন্য বাদে যেকোনো পজেটিভ বা নেগেটিভ নাম্বার ট্রুথি ভ্যালু
৩। এম্পটি স্ট্রিং বাদে সকল স্ট্রিং ট্রুথি ভ্যালু
৪। '0' 'false' এগুলো হলো স্ট্রিং, তাই ট্রুথি
৫। অবজেক্ট বা এম্পটি অবজেক্ট ট্রুথি ভ্যালু। {}
৬। এরে বা এম্পটি এরে ট্রুথি ভ্যালু। [১২,২৫,১৪]


>> Falsy Value
১। বুলিয়ান ভেরিয়েবল এর মান যদি false হয়।
২। শুন্য ফলসি ভ্যালু
৩। এম্পটি স্ট্রিং ফলসি ভ্যালু ''
৪। undefined
৫। null
*/