/*
 সাধারনত ৮ টি উপায়ে  Undefined  পাওয়া যায়।
 ১। কোনো ভেরিয়েবল এর মান দেয়া না থাকলে।
 ২। ফাংশনে কোনোকিছু রিটার্ন না করলে।
 ৩। ফাংশনে কোনো প্যারামিটার পাস না করেই আউটপুট পেতে চাইলে।
 ৪। যদি রিটার্নের ডান পাশে কি রিটার্ন করবে তা না বলা থাকে।
 ৫। অবজেক্ট এর ভিতরে কোনো একটা প্রোপার্টি না থাকা সত্যেও আমরা যদি ডট নোটেশন বা ব্র্যাকেট নোটেশনের দ্বারা পেতে চাই তাহলে  Undefined আসবে।
 ৬। এরে এর ইন্ডেক্স যতগুলো আছে তার চেয়ে বেশী ইন্ডেক্সের ভ্যালু খুজতে চাইলে।
 ৭। এরে এর মাঝ থেকে কোনো ইন্ডেক্স ডিলিট করে দিয়ে সেই ইন্ডেক্স পেতে চাইলে।
 ৮। কোনো ভেরিয়েবল এর ভ্যালু সরাসরি Undefined সেট করলে।

  <<<<====================================================================>>>>
    এর উদাহরন দেখতে চাইলে ৩২-২ মডিউল দেখতে হবে।
 */ 