/*

 ArrayName.filter দ্বারা এরের সব গুলো ইলিমেন্টের উপর লুপ করে। লুপ করে প্রত্যেকটা এলিমেন্ট এর উপর এরো ফাংশনে প্রদত্ত শর্ত প্রয়োগ করে। যে সকল এলিমেন্ট শর্ত পুরন করে সেই এলিমেন্ট গুলোকে একটি এরে তে রেখে সেই এরে টা রিটার্ন করে। এটা মোটামুটী ভাবে map এর খালাতো ভাই বলা যায়।

 filter শর্ত পুরন কৃত সবগুলো এলিমেন্ট রিটার্ন করে। আর যদি শর্ত অনুযাইয়ী কোন এলিমেন্ট খুজে না পায় তবে একটা এম্পটি এরে রিটার্ন করে। 
 */


 const numbers = [4, 9, 5, 7, 8, 1, 2, 5]

 const Selected = numbers.filter(num => num > 5)
 console.log(Selected) // Result will be [ 9, 7, 8 ] (৫ এর চেয়ে বড় গুলোকে রিটার্ন করবে)
 
 const evenElement = numbers.filter(num => num % 2 === 0)
 console.log(evenElement) // Result will be [ 4, 8, 2 ] (জোড় সংখ্যাগুলোকে শুধু রিটার্ন করবে)
 