/*

 ArrayName.find দ্বারা এরের সব গুলো ইলিমেন্টের উপর লুপ করে। লুপ করে প্রত্যেকটা এলিমেন্ট এর উপর এরো ফাংশনে প্রদত্ত শর্ত প্রয়োগ করে। যে সকল এলিমেন্ট শর্ত পুরন করে সেই এলিমেন্ট গুলোর প্রথম উপাদান টি রিটার্ন করে। এটা মোটামুটিভাবে filter এর খালাতো ভাই বলা যায়।

 filter শর্ত পুরন কৃত সবগুলো এলিমেন্ট রিটার্ন করে, আর find শর্ত পুরন করা এলিমেন্ট এর মধ্যে থেকে শুধু প্রথমটিকে রিটার্ন করে। আর যদি শর্ত অনুযাইয়ী কোন এলিমেন্ট খুজে না পায় তবে undefind রিটার্ন করে। 

 */


 const numbers = [4, 9, 5, 7, 8, 1, 2, 5]

 const Selected = numbers.find(num => num > 5)
 console.log(Selected) // Result will be 9 (৫ এর চেয়ে বড় প্রথম সংখ্যাটি হলো ৯)
 
 const evenElement = numbers.find(num => num % 2 === 0)
 console.log(evenElement) // Result will be 4 (প্রথম জোড় সংখ্যাটি হলো ৪)
 