/*

 ArrayName.reduce দ্বারা এরের সব গুলো ইলিমেন্টের উপর লুপ করে। প্রথম উপাদানের সাথে দ্বিতীয় উপাদান যোগ করে। যোগ ফল টা কে বলে Previous Value এবং তৃতীয় উপাদান টাকে বলা হয় Current value. তারপর আবার আগের যোগফল এর সাথে বর্তমান উপাদান যোগ করে আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে, আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে, আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে, আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে, আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে, আবার যোগফলের সাথে পরবর্তী উপাদান যোগ করে। 
 */


 const numbers = [4, 9, 5, 7, 8, 1, 2, 5]

 const Sum = numbers.reduce((previous , curent) => previous + curent , 0)
 console.log(Sum) // Result will be 41 (4+9=13, 13+5=18, 18+7=25...........)
 