// Math.max ব্যাবহার করে আমরা নাম্বারস থেকে ম্যাক্স নাম্বার বের করতে পারি।

const Max = Math.max(45, 36, 12, 75, 18, 9, 4, 25, 65, 75);
console.log(Max)


// কোনো এরে এর নাম্বারস থেকে শুধু নাম্বার গুলা পেতে চাইলে ওই ভেরিয়েবল এর আগে থ্রী ডটস দিতে হবে।
const numbers = [54, 62, 45, 78, 51, 23, 45, 95, 12, 64, 85];
const maxInArray = Math.max(...numbers)
console.log(maxInArray)



// একটা এরে কে যখন সরাসরি অন্য একটা ভেরিয়েবল এ সেট করে ফেলি তখন আগের যে এরে টা ওইটাই কম্পিউটারে স্টোর করে রাখে। যেমন bondhu
const friends = [54, 62, 45, 15, 35, 14, 75, 84]
const bondhu = friends // Output of bondhu will be [54,62,45,15,35,14,75,84]

// একটা এরে কে যখন Spread করে (...) অন্য একটা ভেরিয়েবল এ সেট করে ফেলি তখন আগের যে এরে টা ওইটা ছাড়াও কম্পিউটারে নতুন একটা এরে ক্রিয়েট করে। বা কপি করে। যেমন dosto
const copyOfFriends = [...friends]

// Spread (...) করে এরের সামনে পিছনে নতুন এলিমেন্ট যোগ করা যায়।
const Mamma = [54, 78, 62, 45, 15, 96, 35, 14, 75, 84, 26]
const Mammaaa = [99,88,77,...Mamma,22,33,55]
console.log(Mammaaa)


