// Three Types of variable.
// var ------ const ------- let 
// Ver - ব্যাবহার করবো না। 
// Let - মান পরিবর্তন করা যাবে
// Const - মান পরিবর্তন করা যাবে না।



// এটা প্রাচীন কালের মেথড। আমরা এখন আর ইউজ করবো না। 
var name = "Asaduzzaman Rakib"




// যখন ভ্যারিয়েবল এর মান পরবর্তিতে পরিবর্তনের প্রয়োজন হয় তখন লেট দিয়ে ভেরিয়েবল ডিকলেয়ার করা হয়
let year = 2024



// যখন ভ্যারিয়েবল এর মান পরবর্তিতে পরিবর্তনের প্রয়োজন হয় না, তখন কনস্ট্যান্ট দিয়ে ভেরিয়েবল ডিকলেয়ার করা হয়

const dateOfBirth = "1 January 1999"